<!DOCTYPE html>
<html>
<head>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
  
  <title>阿姆斯特丹之行 - ct.Liu</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x5F53;&amp;#x4E0B;&amp;#x706B;&amp;#x8F66;&amp;#xFF0C;&amp;#x8E0F;&amp;#x4E0A;&amp;#x963F;&amp;#x59C6;&amp;#x65AF;&amp;#x7279;&amp;#x4E39;&amp;#x7684;&amp;#x8857;&amp;#x9053;&amp;#x65F6;&amp;#xFF0C;&amp;#x6211;&amp;#x770B;&amp;#x5230;&amp;#x4E86;&amp;#x4EE5;&amp;#x5F80;&amp;#x5728;&amp;#x5C4F">
<meta property="og:type" content="article">
<meta property="og:title" content="阿姆斯特丹之行">
<meta property="og:url" content="http://ctliu3.com/2016/10/16/days-in-amsterdam/index.html">
<meta property="og:site_name" content="ct.Liu">
<meta property="og:description" content="&amp;#x5F53;&amp;#x4E0B;&amp;#x706B;&amp;#x8F66;&amp;#xFF0C;&amp;#x8E0F;&amp;#x4E0A;&amp;#x963F;&amp;#x59C6;&amp;#x65AF;&amp;#x7279;&amp;#x4E39;&amp;#x7684;&amp;#x8857;&amp;#x9053;&amp;#x65F6;&amp;#xFF0C;&amp;#x6211;&amp;#x770B;&amp;#x5230;&amp;#x4E86;&amp;#x4EE5;&amp;#x5F80;&amp;#x5728;&amp;#x5C4F">
<meta property="og:image" content="http://ctliu3.com/2016/10/16/days-in-amsterdam/amsterdam-canal-view.jpg">
<meta property="og:image" content="http://ctliu3.com/2016/10/16/days-in-amsterdam/zaanse-schans.jpg">
<meta property="og:image" content="http://ctliu3.com/2016/10/16/days-in-amsterdam/cheese.jpg">
<meta property="og:image" content="http://ctliu3.com/2016/10/16/days-in-amsterdam/booking-lunch.jpg">
<meta property="og:updated_time" content="2016-10-16T17:32:53.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="阿姆斯特丹之行">
<meta name="twitter:description" content="&amp;#x5F53;&amp;#x4E0B;&amp;#x706B;&amp;#x8F66;&amp;#xFF0C;&amp;#x8E0F;&amp;#x4E0A;&amp;#x963F;&amp;#x59C6;&amp;#x65AF;&amp;#x7279;&amp;#x4E39;&amp;#x7684;&amp;#x8857;&amp;#x9053;&amp;#x65F6;&amp;#xFF0C;&amp;#x6211;&amp;#x770B;&amp;#x5230;&amp;#x4E86;&amp;#x4EE5;&amp;#x5F80;&amp;#x5728;&amp;#x5C4F">
<meta name="twitter:image" content="http://ctliu3.com/2016/10/16/days-in-amsterdam/amsterdam-canal-view.jpg">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link href="/webfonts/ptserif/main.css" rel='stylesheet' type='text/css'>
  <link href="/webfonts/source-code-pro/main.css" rel="stylesheet" type="text/css">
  <link rel="stylesheet" href="/css/style.css"><!-- hexo-inject:begin --><!-- hexo-inject:end -->
  

</head>

<body>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><div id="container">
    <header id="header">
  <div id="header-outer" class="outer">
    <div id="header-inner" class="inner">
      <a id="main-nav-toggle" class="nav-icon" href="javascript:;"></a>
      <a id="logo" class="logo" href="/"></a>
      <nav id="main-nav">
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/categories">Categories</a>
        
          <a class="main-nav-link" href="/tags">Tags</a>
        
          <a class="main-nav-link" href="/about">About</a>
        
          <a class="main-nav-link" href="/atom.xml">Rss</a>
        
      </nav>
      <nav id="sub-nav">
        <div id="search-form-wrap">
          <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://ctliu3.com"></form>
        </div>
      </nav>
    </div>
  </div>
</header>
    <section id="main" class="outer"><article id="post-days-in-amsterdam" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      阿姆斯特丹之行
    </h1>
  

      </header>
    
    <div class="article-meta">
      <a href="/2016/10/16/days-in-amsterdam/" class="article-date">
  <time datetime="2016-10-16T15:23:37.000Z" itemprop="datePublished">2016-10-16</time>
</a>
      
  <div class="article-category">
    <a class="article-category-link" href="/categories/Life/">Life</a>
  </div>

      
    </div>
    <div class="article-entry" itemprop="articleBody">
      
        <img src="/2016/10/16/days-in-amsterdam/amsterdam-canal-view.jpg" class="full-image" width="800" height="150" alt="&#x9634;&#x5929;&#x91CC;&#x7684;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x8FD0;&#x6CB3;">
<p>&#x5F53;&#x4E0B;&#x706B;&#x8F66;&#xFF0C;&#x8E0F;&#x4E0A;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x7684;&#x8857;&#x9053;&#x65F6;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x4E86;&#x4EE5;&#x5F80;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x624D;&#x4F1A;&#x770B;&#x5230;&#x7684;&#x753B;&#x9762;&#xFF1A;&#x4E0D;&#x9AD8;&#x4F46;&#x5320;&#x5FC3;&#x72EC;&#x8FD0;&#x7684;&#x6B27;&#x5F0F;&#x5EFA;&#x7B51;&#x3001;&#x6F02;&#x6D6E;&#x7740;&#x5EFA;&#x7B51;&#x5012;&#x5F71;&#x7684;&#x8FD0;&#x6CB3;&#x3001;&#x65F6;&#x505C;&#x65F6;&#x98DE;&#x7684;&#x9E3D;&#x5B50;&#x3002;&#x624D; 8 &#x70B9;&#x591A;&#xFF0C;&#x8857;&#x4E0A;&#x5076;&#x5C14;&#x51E0;&#x4E2A;&#x8DD1;&#x6B65;&#x7684;&#x4EBA;&#xFF0C;&#x5730;&#x4E0A;&#x4E0D;&#x7B97;&#x5E72;&#x51C0;&#xFF0C;&#x7A7A;&#x6C14;&#x4E2D;&#x900F;&#x7740;&#x5BD2;&#x6C14;&#xFF0C;&#x57CE;&#x5E02;&#x8FD8;&#x6CA1;&#x5B8C;&#x5168;&#x9192;&#x6765;&#x3002;</p>
<a id="more"></a>
<img src="/2016/10/16/days-in-amsterdam/zaanse-schans.jpg" class="full-image" width="600" height="400" alt="&#x98CE;&#x8F66;&#x6751;&#xFF0C;&#x5B9E;&#x5728;&#x662F;&#x4E00;&#x4E2A;&#x4E16;&#x5916;&#x6843;&#x82B1;&#x6E90;">
<p>&#x5728;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x7684;&#x8FD9;&#x51E0;&#x5929;&#x91CC;&#xFF0C;&#x5C3D;&#x7BA1;&#x6709;&#x65F6;&#x5DEE;&#xFF0C;&#x4F46;&#x6211;&#x603B;&#x8D77;&#x5F97;&#x5F88;&#x65E9;&#xFF0C;&#x5F02;&#x5730;&#x665A;&#x9192;&#x603B;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#x53EF;&#x60DC;&#x3002;&#x6BCF;&#x5929;&#x884C;&#x8D70;&#x5728;&#x8857;&#x4E0A;&#xFF0C;&#x6211;&#x603B;&#x523B;&#x610F;&#x653E;&#x6162;&#x811A;&#x6B65;&#xFF0C;&#x6B23;&#x8D4F;&#x7740;&#x6CBF;&#x9014;&#x7684;&#x4E00;&#x5207;&#x98CE;&#x666F;&#x3002;&#x8FD9;&#x662F;&#x4E2A;&#x4E0E;&#x8BD7;&#x7ED3;&#x4F34;&#xFF0C;&#x4E0E;&#x6B4C;&#x540C;&#x884C;&#x7684;&#x57CE;&#x5E02;&#x3002;&#x57CE;&#x5E02;&#x5185;&#x90E8;&#x6709;&#x56FD;&#x5BB6;&#x535A;&#x7269;&#x9986;&#x3001;&#x51AF;&#x5FB7;&#x5C14;&#x516C;&#x56ED;&#x3001;&#x6C34;&#x575D;&#x5E7F;&#x573A;&#x7B49;&#x666F;&#x70B9;&#xFF0C;&#x8FDC;&#x4E9B;&#x6709;&#x98CE;&#x8F66;&#x6751;&#x3001;&#x7F8A;&#x89D2;&#x6751;&#x7B49;&#x8BA9;&#x4EBA;&#x6D41;&#x8FDE;&#x5FD8;&#x8FD4;&#x7684;&#x53BB;&#x5904;&#x3002;&#x8FD9;&#x91CC;&#x6709;&#x4E0A;&#x767E;&#x6761;&#x8FD0;&#x6CB3;&#xFF0C;&#x6BCF;&#x8D70;&#x51E0;&#x6B65;&#x5C31;&#x4F1A;&#x8BA9;&#x4EBA;&#x6709;&#x62CD;&#x7167;&#x7684;&#x6B32;&#x671B;&#x3002;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x57CE;&#x5E02;&#x4E0D;&#x5927;&#xFF0C;&#x6C7D;&#x8F66;&#x4E5F;&#x4E0D;&#x591A;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x5C45;&#x6C11;&#x4E3B;&#x8981;&#x4EE5;&#x81EA;&#x884C;&#x8F66;&#x4EE3;&#x6B65;&#xFF0C;&#x8857;&#x9053;&#x6709;&#x4E0A;&#x4E13;&#x95E8;&#x7684;&#x81EA;&#x884C;&#x8F66;&#x9053;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x4EBA;&#x53E3;&#x6570;&#x91CF;&#x4E0D;&#x591A;&#xFF0C;&#x767D;&#x5929;&#x7684;&#x70ED;&#x95F9;&#x4E3B;&#x8981;&#x6765;&#x6E90;&#x4E8E;&#x4EBA;&#x4EEC;&#x5BF9;&#x751F;&#x6D3B;&#x7684;&#x70ED;&#x60C5;&#x548C;&#x4EAB;&#x53D7;&#x3002;&#x89C1;&#x8FC7;&#x5728;&#x535A;&#x7269;&#x9986;&#x9644;&#x8FD1;&#x5F39;&#x594F;&#x7740;&#x5947;&#x602A;&#x4E50;&#x5668;&#x7684;&#x97F3;&#x4E50;&#x4EBA;&#xFF0C;&#x89C1;&#x8FC7;&#x5728;&#x9152;&#x5E97;&#x9644;&#x8FD1;&#x5E26;&#x7740;&#x72D7;&#x72D7;&#x4E5E;&#x8BA8;&#x7684;&#x6D41;&#x6D6A;&#x6C49;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x573A;&#x666F;&#x51FA;&#x73B0;&#x5728;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x8FD9;&#x4E2A;&#x57CE;&#x5E02;&#x91CC;&#x5374;&#x8BA9;&#x4EBA;&#x611F;&#x89C9;&#x610F;&#x5916;&#x5730;&#x548C;&#x8C10;&#x3002;</p>
<img src="/2016/10/16/days-in-amsterdam/cheese.jpg" class="full-image" width="600" height="400" alt="&#x5F53;&#x5730;&#x4EBA;&#x559C;&#x6B22;&#x5403;&#x7684;&#x5976;&#x916A;">
<p>&#x8FD9;&#x662F;&#x7684;&#x996E;&#x98DF;&#x76F8;&#x5BF9;&#x4E8E;&#x56FD;&#x5185;&#x7684;&#x8FD8;&#x662F;&#x504F;&#x8D35;&#xFF0C;&#x74F6;&#x88C5;&#x6C34;&#x6216;&#x662F;&#x996E;&#x6599;&#x90FD;&#x8981; 2 &#x6B27;&#x5DE6;&#x53F3;&#xFF0C;&#x4E00;&#x9910;&#x7684;&#x666E;&#x901A;&#x6D88;&#x8D39;&#x5DEE;&#x4E0D;&#x591A; 15 &#x6B27;&#x5DE6;&#x53F3;&#x3002;&#x5728;&#x996D;&#x5E97;&#x5403;&#x5B8C;&#x540E;&#xFF0C;&#x670D;&#x52A1;&#x5458;&#x7ECF;&#x5E38;&#x4F1A;&#x95EE;&#xFF1A;&#x201C;Do you enjoy?&#x201D;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x4E8E;&#x5403;&#x60EF;&#x4E86;&#x4E2D;&#x56FD;&#x83DC;&#x7684;&#x6211;&#x4EEC;&#xFF0C;&#x6709;&#x65F6;&#x8FDE;&#x56DE;&#x7B54; &#x201C;Yes&#x201D; &#x90FD;&#x4F1A;&#x89C9;&#x5F97;&#x9762;&#x9732;&#x96BE;&#x8272;&#xFF0C;&#x6BD4;&#x5982;&#x89C9;&#x5F97;&#x8FD9;&#x91CC;&#x7684;&#x57F9;&#x6839;&#x505A;&#x5F97;&#x592A;&#x54B8;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x5976;&#x916A;&#x5473;&#x9053;&#x592A;&#x91CD;&#x3002;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x6709;&#x51E0;&#x79CD;&#x4EA4;&#x901A;&#x5DE5;&#x5177;&#xFF1A;&#x516C;&#x4EA4;&#x3001;&#x5730;&#x94C1;&#x3001;&#x6709;&#x8F68;&#x7535;&#x8F66;&#xFF08;tram&#xFF09;&#x3001;&#x706B;&#x8F66;&#x548C;&#x81EA;&#x884C;&#x8F66;&#x3002;&#x5728;&#x8DEF;&#x4E0A;&#x884C;&#x8D70;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x7279;&#x610F;&#x7559;&#x610F;&#x4EBA;&#x884C;&#x9053;&#x548C;&#x81EA;&#x884C;&#x8F66;&#x9053;&#x3002;&#x5F53;&#x5730;&#x6709;&#x4E9B;&#x4EBA;&#x9A91;&#x81EA;&#x884C;&#x8F66;&#x6BD4;&#x8F83;&#x5FEB;&#xFF0C;&#x8D70;&#x5728;&#x8DEF;&#x4E0A;&#x65F6;&#xFF0C;&#x65F6;&#x4E0D;&#x65F6;&#x4F1A;&#x6709;&#x81EA;&#x884C;&#x8F66;&#x4ECE;&#x4F60;&#x8EAB;&#x65C1;&#x547C;&#x5578;&#x800C;&#x8FC7;&#x3002;</p>
<p>&#x5728;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x7684;&#x51E0;&#x5929;&#x91CC;&#xFF0C;&#x62DC;&#x8BBF;&#x4E86;&#x4E00;&#x4E2A;&#x5728; <a href="http://www.booking.com/" target="_blank" rel="external">booking.com</a> &#x5DE5;&#x4F5C;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x53C2;&#x89C2;&#x4E86;&#x516C;&#x53F8;&#x7684;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x3002;&#x8C08;&#x8BDD;&#x4E2D;&#xFF0C;&#x804A;&#x8D77;&#x4E86;&#x5F53;&#x5730;&#x548C;&#x56FD;&#x5185;&#x5317;&#x4E0A;&#x5E7F;&#x4E00;&#x4E9B;&#x5927;&#x57CE;&#x5E02;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x6DF1;&#x89C9;&#x5F88;&#x591A;&#x4E8B;&#x90FD;&#x662F;&#x56F4;&#x57CE;&#x3002;&#x7528;&#x4E00;&#x53E5;&#x4E60;&#x8BED;&#x5F62;&#x5BB9;&#x5F88;&#x8D34;&#x5207;&#xFF1A;<code>You win some, you lose some</code>&#x3002;&#x4F46;&#x5176;&#x5B9E;&#x4EC0;&#x4E48;&#x4E8B;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x5462;&#xFF1F;</p>
<img src="/2016/10/16/days-in-amsterdam/booking-lunch.jpg" class="full-image" width="600" height="400" alt="booking &#x7684;&#x5348;&#x9910;&#xFF0C;&#x79CD;&#x7C7B;&#x7E41;&#x591A;">
<p>&#x6211;&#x5728;&#x6211;&#x7684; <a href="https://www.instagram.com/ct.liu/" target="_blank" rel="external">instagram</a> &#x4E3B;&#x9875;&#x4E0A;&#x52A0;&#x4E86;&#x6240;&#x53BB;&#x8FC7;&#x56FD;&#x5BB6;&#x7684;&#x56FD;&#x65D7;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#x5F88;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x4F46;&#x66F4;&#x591A;&#x7684;&#x56FD;&#x65D7;&#x5374;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x3002;&#x6211;&#x5F88;&#x559C;&#x6B22;&#x65E5;&#x672C;&#xFF0C;&#x4E5F;&#x5F88;&#x559C;&#x6B22;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#xFF0C;&#x4F46;&#x4E0D;&#x89C9;&#x5F97;&#x5230;&#x5F02;&#x5730;&#x7684;&#x6E38;&#x73A9;&#x5E94;&#x8BE5;&#x662F;&#x79CD;&#x5E38;&#x6001;&#x3002;&#x6709;&#x4E9B;&#x4E8B;&#x5076;&#x5C14;&#x4E3A;&#x4E4B;&#x624D;&#x6709;&#x5B83;&#x7684;&#x8272;&#x5F69;&#xFF0C;&#x751F;&#x6D3B;&#xFF0C;&#x603B;&#x80FD;&#x627E;&#x5230;&#x5176;&#x5B83;&#x5E73;&#x51E1;&#x7684;&#x70B9;&#x7F00;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5F53;&#x6211;&#x4EE5;&#x4EBA;&#x6587;&#x4E3A;&#x89C6;&#x89D2;&#x5230;&#x5904;&#x884C;&#x8D70;&#xFF0C;&#x5C31;&#x53E6;&#x5F53;&#x522B;&#x8BBA;&#x4E86;&#x3002;</p>
<h4 id="&#x610F;&#x5916;&#x7684;&#x63D2;&#x66F2;"><a href="#&#x610F;&#x5916;&#x7684;&#x63D2;&#x66F2;" class="headerlink" title="&#x610F;&#x5916;&#x7684;&#x63D2;&#x66F2;"></a>&#x610F;&#x5916;&#x7684;&#x63D2;&#x66F2;</h4><p>&#x672C;&#x6765;&#x5E94;&#x8BE5;&#x662F; 16 &#x53F7;&#x65E9;&#x4E0A;&#x56DE;&#x5317;&#x4EAC;&#xFF0C;&#x5374;&#x56E0;&#x56DE;&#x7A0B;&#x7684;&#x822A;&#x7A7A;&#x516C;&#x53F8;&#xFF08;&#x8377;&#x5170;&#x7687;&#x5BB6;&#x822A;&#x7A7A;&#x516C;&#x53F8;&#xFF0C;KLM&#xFF09;&#x8D85;&#x552E;&#xFF0C;&#x5BFC;&#x81F4;&#x6700;&#x540E;&#x67D0;&#x540D;&#x5730;&#x6362;&#x4E86;&#x4E2A;&#x822A;&#x73ED;&#xFF0C;&#x8BA4;&#x8BC6;&#x4E86; 2 &#x4E2A;&#x540C;&#x6837;&#x906D;&#x9047;&#x7684;&#x4E2D;&#x56FD;&#x53CB;&#x4EBA;&#xFF0C;&#x9014;&#x4E2D;&#x8F6C;&#x673A;&#x65F6;&#x5728;&#x571F;&#x8033;&#x5176;&#x673A;&#x573A;&#x5446;&#x4E86;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x4E5F;&#x7B97;&#x662F;&#x4E00;&#x4E2A;&#x5947;&#x5999;&#x7684;&#x7ECF;&#x5386;&#x4E86;&#x3002;</p>

      
    </div>
    
    
      <footer class="article-footer">
        
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/amsterdam/">amsterdam</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/travel/">travel</a></li></ul>

      </footer>
    
  </div>
  
    
<nav id="article-nav">
  
  
    <a href="/2016/09/16/japan-trip/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">日本之行&nbsp;<span>&gt;</span></div>
    </a>
  
</nav>

  
</article>




<div class="share_addthis">
  <div class="sharing addthis_toolbox share">
    <a class="addthis_button_facebook_like"></a>
    <a class="addthis_button_tweet"></a>
    <a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
    <a class="addthis_counter addthis_pill_style"></a>
  </div>
  <script type="text/javascript" src="//s7.addthis.com/js/300/addthis_widget.js#pubid=ra-560c64c35486b3d4" async="async"></script>
</div>




<section id="comments">
  <div id="disqus_thread">
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
  </div>
</section>


</section>
    <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 ctliu3&nbsp;
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>, theme by <a href="http://github.com/ppoffice">PPOffice</a>
    </div>
  </div>
</footer>
    
<script>
  var disqus_shortname = 'ctliu3';
  
  var disqus_url = 'http://ctliu3.com/2016/10/16/days-in-amsterdam/';
  
  (function(){
    var dsq = document.createElement('script');
    dsq.type = 'text/javascript';
    dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>


<script src="/js/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>
  </div><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</body>
</html>